# ElementNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementNode Members
ElementNode Class Methods Properties See Also
---
The ElementNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RenderNode.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | Gets the document associated with the element. |
| ElementId | The Id of the element. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
| LinkInstanceId | The Id of the link instance for the element. |
| NodeName | A readable name of the output node.  (Inherited from RenderNode.) |

# See Also
ElementNode Class
Autodesk.Revit.DB Namespace